import aboutUsPageBg1 from "../assets/img/about-us-page-bg-1-min.jpg";
const AboutUsPage = () => {
  return (
    <div>
      <section className="container mx-auto px-6 md:px-3 mb-8 md:mb-6">
        <h1 className="mb-4 md:mb-8 text-2xl md:text-4xl font-semibold text-gray-800">
          درباره ما
        </h1>
        <div className="flex flex-col-reverse lg:flex-row items-center">
          <div className="w-full lg:w-2/3 md:px-4">
            <p className="mb-2 md:mb-4 text-sm md:text-base">
              سایت دٌریاد توسط سینا قیاسی دانشجوی رشته مهندسی کامپیوتر از
              دانشگاه علم و فرهنگ و برنامه نویس حوزه وب توسعه یافته تا با کمک
              دوره هایی کاربردی، پروژه محور و به روز بتوانید مسیر آموزش و تمرین
              تا ورود به بازار کار را بهترین و سریع ترین شکل طی کنید.
            </p>
            <p className="mb-2 md:mb-4 text-sm md:text-base">
              دریاد یک سایت آموزشی معتبر و قابل اعتماد است که به دانشجویان و
              علاقه‌مندان به یادگیری برنامه‌نویسی کمک می‌کند تا با بهره‌گیری از
              دوره‌های آموزشی با محتوای کامل و جذاب، مهارت‌های خود را در زمینه
              برنامه‌نویسی بهبود بخشند. دوره‌های دریاد شامل مباحث مختلفی در
              زمینه برنامه‌نویسی هستند که با استفاده از روش‌های مدرن و موثر در
              آموزش برنامه‌نویسی، به دانشجویان کمک می‌کنند تا به راحتی و با لذت
              بیشتر، مهارت‌های خود را در این حوزه بهبود دهند. هدف دریاد این است
              که با ارائه دوره‌های آموزشی با کیفیت، دانشجویان را به یادگیری
              برنامه‌نویسی ترغیب کند و برای آنان امکانات مناسبی فراهم کند تا
              بتوانند به راحتی و با لذت بیشتر، مهارت‌های خود را در زمینه
              برنامه‌نویسی بهبود بخشند. ما با تلاش برای بهبود هر چه بیشتر کیفیت
              دوره‌های آموزشی خود، سعی داریم تا به عنوان یک سایت معتبر و قابل
              اعتماد در زمینه آموزش برنامه‌نویسی شناخته شویم.
            </p>
          </div>
          <div className="w-full lg:w-1/3 md:px-4 mb-4">
            <img className="rounded-md" src={aboutUsPageBg1} alt="about us" />
          </div>
        </div>
      </section>
    </div>
  );
};

export default AboutUsPage;
