import frontendRoadmap from "../assets/img/roadmap-sh-frontend-min.png";
const LearningRoadmapPage = () => {
  return (
    <div>
      <section className="container mx-auto px-6 md:px-3 mb-8 md:mb-6">
        <h1 className="mb-4 md:mb-8 text-2xl md:text-4xl font-semibold text-gray-800">
          نقشه راه یادگیری
        </h1>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          در این مقاله قصد داریم شما را با مسیر آموزشی تبدیل شدن به یک برنامه
          نویس فرانت اند آشنا کنیم، همچنین برای حوزه های دیگر برنامه نویسی نیز
          یک منبع مناسب برای بررسی نقشه راه یادگیری معرفی خواهیم کرد پس بزن بریم
          👈🏼
        </p>
        <h2 className="mb-2 md:mb-4 text-xl md:text-2xl font-semibold text-gray-800">
          نقشه راه یادگیری فرانت اند
        </h2>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          برای شروع یادگیری حوزه وب باید ابتدا با ساختار نمایش محتوا در وب یعنی
          HTML آشنا شوید HTML یک زبان نشانه گذاری با تگ های از قبل تعریف شده است
          که تمامی صفحات وب محتوای خود را نهایتا با این زبان برای شما میفرستند و
          مروگر شما آن را نمایش می دهد. این تگ های از قبل تعریف شده هر کدام
          کاربرد مختص به خود را داراست و شما باید کاربرد های آن ها را باد
          بگیرید.
        </p>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          قدم بعدی برای شما یاد گرفتن نحوه استایل دهی به این محتوای علامت گذاری
          شده است برای این منظور باید از زبان CSS استفاده کنید. در زبان CSS شما
          با ویژگی های مختلفی سر و کار دارید که با استفاده از آن ها می توانید
          برای المان هایی که انتخاب کرده اید رنگ، اندازه و ... تعریف کنید.
        </p>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          تا این جای کار شما می توانید صفحاتی با محتوای ثابت ایجاد کنید اما برای
          حرکت دادن المان ها، حذف یا اضافه کردن آن ها و دیگر چیز هایی که در سایت
          های مختلف دیده اید باید چه بیاموزید ؟ احتمالا اگر سری به زبان های
          برنامه نویسی زده باشید اسمش را شنیده اید اگر نشنیده اید هم ایرادی
          ندارد این زبان برنامه نویسی قرار است مهمان ویژه ما در حوزه وب باشد.
          نام این زبان جاوااسکریپت (Javascript) است. یک زبان اسکریپتی که برای
          ایجاد عملکرد های رفتاری در صفحات وب ایجاد شد اما امروزه نه تنها در
          حوزه وب و بخش فرانت اند بلکه در بخش بک اند حوزه وب و حتی حوزه موبایل
          نیز خودی نشان داده است.
        </p>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          در این مرحله شما باید مبانی پایه این زبان آشنا گردید هر چه بیش تر بر
          آن ها مسلط شوید کارتان در مراحل بعدی آسان تر خواهد بود .شروع کد زدن در
          این نسبت به زبان های دیگر بسیار آسان تر است کافیست کدی را که میزنید با
          استفاده از مرورگر اجرا کرده و تاثیر آن را در صفحه html ای که ایجاد
          کرده اید ببینید.
        </p>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          در مرحله بعد شما باید با git آشنا گردید. git یک سیستم کنترل ورژن بسیار
          محبوب و پیشرفته است حالا این که گفتی یعنی چی ؟ شما در هر کاری چه نوشتن
          کتاب باشد یا توسعه یک برنامه یا یک سایت نیاز دارید تغییراتی که می دهید
          را سازمان دهی کنید شاید بخواهید تغییرات را به حالت قبل برگردانید یا
          مثلا ببینید در دو نسخه قبل تر از پروژه تان چگونه عمل کرده بودید. این
          جاست که شما به یک سیستم کنترل ورژن نیاز دارید تا به این قابلیت ها دست
          پیدا کنید. git قابلیت های فراوانی دارد اما برای شروع کافیست با کاربردی
          ترین های آن آشنا شوید در مسیر خود می توانید ویژگی های پیشرفته تر آن را
          هم با توجه به نیاز خود یاد بگیرید.
        </p>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          حالا شما مبانی کار را یاد گرفته اید اما امروزه دیگر در پروژه های
          برنامه نویسی از جاوااسکریپت به تنهایی استفاده نمی کنند بلکه برای سرعت
          دادن و راحت تر کردن کار و همچنین پیاده سازی اصولی تر پروژه از کتابخانه
          ها و چارچوب های جاوااسکریپت استفاده می کنند. اما قبل از استفاده از آن
          ها باید روش مدیریت آن ها آشنا شوید مدیریت کتابخانه ها و چارچوب ها در
          جاوااسکریپت توسط npm صورت می گیرد پس از آشنایی با آن می توانید به سراغ
          مرحله بعد یعنی یادگیری یک کتابخانه یا چارچوب بروید. پیشنهاد ما در این
          مرحله کتابخانه ریکت (React) است . این کتابخانه توسط شرکت فیسبوک توسعه
          داده شده و پشتیبانی می شود.
        </p>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          پس از یادگیری یک کتابخانه یا چارچوب حالا برای استایل دادن هم می توانید
          از CSS خام فراتر رفته از کتابخانه ها و چارچوب های این زبان استفاده
          کنید. پیشنهاد ما برای یادگیری یک چارچوب برای زبان CSS چارچوب تیلویند
          (Tailwind) است. این چارچوب هرچند نسبت به چارچوبی مثل بوت استرپ
          (Bootstrap) تازه وارد است، اما به سرعت دارد برای خود در جامعه فرانت
          اند جا باز می کند و به محبوبیت بسیار بالایی رسیده است. از عوامل این
          محبوبیت کم حجم بودن فایل نهایی ، شخصی سازی قدرتمند و پشتیبانی از زبان
          های راست چین مثل فارسی خودمون می توان نام برد.
        </p>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          پس از این اگر ریکت را انتخاب کرده باشید باید چارچوب نکست (Next) را یاد
          بگیرید تا بتوانید صفحات از پیش پردازش (render) شده ایجاد کنید. همچنین
          با توجه به آگهی های کار حوزه فرانت اند هر چه با کتابخانه ها و چارچوب
          های کاربردی و مورد نیاز بیش تر آشنا باشید می توانید در اولویت بالاتری
          برای دستیابی به جایگاه مدنظر دست یابید.
        </p>
        <h3 className="mb-2 md:mb-4 text-xl md:text-2xl font-semibold text-gray-800">
          نکته کلیدی
        </h3>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          تا این جای کار با مسیر یادگیری فرانت اند آشنا شدید ، اما یک برنامه
          نویس خوب بودن فقط به بلد بودن این تکنولوژی ها نیست بلکه شما باید در
          مسیر خود با تمرین مهارت حل مسئله خود را توسعه دهید و در محیط کار مهارت
          های نرم و ارتباطی را بیاموزید تا بتوانید به صورت تیمی کار کنید و یا یک
          تیم را مدیریت کنید.
        </p>
        <h3 className="mb-4 md:mb-8 text-xl md:text-2xl font-semibold text-gray-800">
          مسیر فرانت اند به صورت تصویری
        </h3>
        <img
          className="mx-auto mb-4 md:mb-8"
          src={frontendRoadmap}
          alt="frontend roadmap"
        />
        <h3 className="mb-2 md:mb-4 text-xl md:text-2xl font-semibold text-gray-800">
          منبع برای حوزه های دیگر
        </h3>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          تصویر بالا از سایت{" "}
          <a className="hover:text-lime-600" href="https://roadmap.sh">
            roadmap.sh
          </a>{" "}
          تهیه شده است این سایت در زمینه نقشه راه یادگیری بسیار کارآمد بوده و هم
          به صورت کلی و هم جزئی نقشه راه در حوزه های مختلف را پوشش داده است
          پیشنهاد من استفاده شما از این سایت به عنوان یک منبع برای بررسی نقشه
          راه حوزه مد نظرتان است .
        </p>
        <p className="mb-2 md:mb-4 text-sm md:text-base">
          دمتون گرم که تا اینجا همراهمون بودین امیدوارم اطلاعات مفیدی در
          اختیارتون قرار داده باشیم.
        </p>
      </section>
    </div>
  );
};

export default LearningRoadmapPage;
